src/main/resources/getCountryCurrencyRequest.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://croz.net/camel/example/soap/to/rest/model">
<!--    <soapenv:Header>-->
<!--        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">-->
<!--            <wsse:UsernameToken wsu:Id="UsernameToken-B5BF963B98EF7B437D14920850231404">-->
<!--                <wsse:Username>api-username</wsse:Username>-->
<!--                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">ApiPassword</wsse:Password>-->
<!--            </wsse:UsernameToken>-->
<!--        </wsse:Security>-->
<!--    </soapenv:Header>-->
    <soapenv:Body>
        <mod:getCountryCurrencyRequest>
            <mod:name>London</mod:name>
        </mod:getCountryCurrencyRequest>
    </soapenv:Body>
</soapenv:Envelope>